#2. Написать программу сложения и умножения двух шестнадцатеричных чисел.
# При этом каждое число представляется как массив, элементы которого это цифры числа.
# Например, пользователь ввёл A2 и C4F. Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
# Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

# -----------------------------------------------------------------------------
#                                     Данные

hexadecs = {'0': 0, '1': 1, '2': 2, '3': 3, '4': 4, '5': 5, '6': 6, '7': 7, '8': 8, '9': 9,
            'A': 10, 'B': 11, 'C': 12, 'D': 13, 'E': 14, 'F': 15, }

# -----------------------------------------------------------------------------
#                                     Преобразование
def list_hex_to_dec(_lst):
    _result = []
    for _str in _lst:
        _number = 0
        for _symbol in _str:
            _d = hexadecs.get(_symbol)
            if not _d:
                return None
            _number = _number * 16 + _d
        _result.append(_number)
    return _result

def list_dec_to_hex(_int):
    return [*hex(_int).split('x')[-1].upper()]

# -----------------------------------------------------------------------------
#                                     Вычисления
def calc_sum(_operands):
     return sum(_operands)

def calc_mul(_operands):
    a = 1
    for i in _operands:
        a *= i
    print(a)
    return a

# -----------------------------------------------------------------------------
#                                       Ввод
def data_input():
     inp = [[_s for _s in _h.strip()] for _h in input
    (f'Введите шестнадцатиричные числа через запятую): ')
        .upper().split(',')]
     return inp

# -----------------------------------------------------------------------------
#                                       Main
def main():
    operands = data_input()
    decs = list_hex_to_dec(operands)
    print(f'Были заданы числа: {operands}\n'
          f'Результат сложения: {list_dec_to_hex(calc_sum(decs))}\n'
          f'Результат перемножения: {list_dec_to_hex(calc_mul(decs))}')
# -----------------------------------------------------------------------------
#                                       Вход

main()